Repository: kenichisutan/canadian-budget-en-fr-sentiment-analysis
Catalog: data/corpora/federal-budget/budget-2025-en-budget-2025-fr.tmx
Source language: en_en
Languages: fr_fr

source: (2) The definition qualified investment in subsection 207.01(1) of the Act is replaced by the following: qualified investment qualified investment for a trust governed by a registered plan means (a) money (other than money the fair market value of which exceeds its stated value as legal tender in the country of issuance or money that is held for its numismatic value) and deposits (within the meaning assigned by the Canada Deposit Insurance Corporation Act or with a branch in Canada of a bank) of such money standing to the credit of the trust; (b) a guaranteed investment certificate issued by a trust company incorporated under the laws of Canada or of a province; (c) a bond, debenture, note or similar obligation (i) described in paragraph (a) of the definition fully exempt interest in subsection 212(3), (ii) issued by a corporation, mutual fund trust or limited partnership the shares or units of which are listed on a designated stock exchange in Canada, (iii) issued by a corporation the shares of which are listed on a designated stock exchange outside Canada, (iv) issued by an authorized foreign bank and payable at a branch in Canada of the bank, (v) that was issued as part of a single issue of debt of at least $25 million with an investment grade rating from a prescribed credit rating agency (or had such a rating at the time the debt obligation is acquired by the trust), (vi) that was issued on a continuous basis under a debt issuance program, provided that at least $25 million of debt under the program had been issued and is outstanding with an investment grade rating from a prescribed credit rating agency (or had such a rating at the time the debt obligation is acquired by the trust), (vii) that was acquired by the trust in exchange for a debt obligation that satisfied the condition in subparagraph (v) or (vi) as part of a proposal or an arrangement that has been approved by a court under the Bankruptcy and Insolvency Act or the Companies' Creditors Arrangement Act , or (viii) issued by a public corporation (other than a mortgage investment corporation); (d) a security (other than a future contract or other derivative instrument in respect of which the holder's risk of loss may exceed the holder's cost) that is listed on a designated stock exchange; (e) a share of the capital stock of a public corporation (other than a mortgage investment corporation); (f) an investment contract described in subparagraph (b)(ii) of the definition retirement savings plan in subsection 146(1) and issued by a corporation approved by the Governor in Council for the purposes of that subparagraph; (g) a contract for an annuity issued by a licensed annuities provider if (i) the trust is the only person that, disregarding a subsequent transfer of the contract by the trust, is or may become entitled to an annuity payment under the contract, and (ii) the holder of the contract has a right to surrender the contract at any time for an amount that would, if reasonable sales and administration charges were ignored, approximate the value of funds that could otherwise be applied to fund future periodic payments under the contract; (h) if the registered plan is a RESP, an investment that was acquired by the trust before October 28, 1998; (i) if the registered plan is a RDSP, a contract for an annuity issued by a licensed annuities provider if (i) annual or more frequent periodic payments are or may be made under the contract to the holder of the contract, (ii) the trust is the only person who, disregarding any subsequent transfer of the contract by the trust, is or may become entitled to any annuity payments under the contract, (iii) neither the time nor the amount of any payment under the contract may vary because of the length of any life, other than the life of the beneficiary under the RDSP (in this paragraph referred to as the "RDSP beneficiary"), (iv) the day on which the periodic payments began or are to begin is not later than the end of the later of (A) the year in which the RDSP beneficiary attains the age of 60 years, and (B) the year following the year in which the contract was acquired by the trust, (v) the periodic payments are payable for the life of the RDSP beneficiary and either there is no guaranteed period under the contract or there is a guaranteed period that does not exceed 15 years, (vi) the periodic payments (A) are equal, or (B) are not equal solely because of one or more adjustments that would, if the contract were an annuity under a retirement savings plan, be in accordance with subparagraphs 146(3)(b)(iii) to (v) or that arise because of a uniform reduction in the entitlement to the periodic payments as a consequence of a partial surrender of rights to the periodic payments, and (vii) the contract requires that, in the event the plan must be terminated in accordance with paragraph 146.4(4)(p), any amounts that would otherwise be payable after the termination be commuted into a single payment; (j) if the registered plan is a RRIF, a contract for an annuity issued by a licensed annuities provider if (i) annual or more frequent periodic payments are or may be made under the contract to the holder of the contract, (ii) the trust is the only person who, disregarding any subsequent transfer of the contract by the trust, is or may become entitled to any annuity payments under the contract, (iii) neither the time nor the amount of any payment under the contract may vary because of the length of any life, other than (A) if the annuitant under the RRIF (in this paragraph referred to as the "RRIF annuitant") has made the election referred to in the definition retirement income fund in subsection 146.3(1) in respect of the fund and a spouse or common-law partner, the life of the RRIF annuitant or the life of the spouse or common-law partner, and (B) in any other case, the life of the RRIF annuitant, (iv) the day on which the periodic payments began or are to begin (in this paragraph referred to as the "start date") is not later than the end of the year following the year in which the contract was acquired by the trust, (v) either (A) the periodic payments are payable for the life of the RRIF annuitant or the joint lives of the RRIF annuitant and the RRIF annuitant's spouse or common-law partner and either there is no guaranteed period under the contract or there is a guaranteed period that begins at the start date and does not exceed a term equal to 90 years minus the lesser of (I) the age in whole years at the start date of the RRIF annuitant (determined on the assumption that the RRIF annuitant is alive at the start date), and (II) the age in whole years at the start date of a spouse or common-law partner of the RRIF annuitant (determined on the assumption that a spouse or common-law partner of the RRIF annuitant at the time the contract was acquired is a spouse or common-law partner of the RRIF annuitant at the start date), or (B) the periodic payments are payable for a term equal to (I) 90 years minus the age described in subclause (A)(I), or (II) 90 years minus the age described in subclause (A)(II), and (vi) the periodic payments (A) are equal, or (B) are not equal solely because of one or more adjustments that would, if the contract were an annuity under a retirement savings plan, be in accordance with subparagraphs 146(3)(b)(iii) to 146(3)(b)(v) or that arise because of a uniform reduction in the entitlement to the periodic payments as a consequence of a partial surrender of rights to the periodic payments; (k) if the registered plan is a RRSP, a contract for an annuity issued by a licensed annuities provider if it (i) is described in the definition retirement income in subsection 146(1) in respect of the annuitant under the RRSP (in this paragraph referred to as the "RRSP annuitant"), or (ii) meets the following conditions: (A) annual or more frequent periodic payments are or may be made under the contract to the holder of the contract, (B) the trust is the only person who, disregarding any subsequent transfer of the contract by the trust, is or may become entitled to any annuity payments under the contract, (C) neither the time nor the amount of any payment under the contract may vary because of the length of any life, other than the life of the RRSP annuitant, (D) the day on which the periodic payments began or are to begin (in this subparagraph referred to as the "start date") is not later than the end of the year in which the RRSP annuitant attains 72 years of age, (E) either (I) the periodic payments are payable for the life of the RRSP annuitant and either there is no guaranteed period under the contract or there is a guaranteed period that begins at the start date and does not exceed a term equal to 90 years minus the lesser of 1 the age in whole years at the start date of the RRSP annuitant (determined on the assumption that the RRSP annuitant is alive at the start date), and 2 the age in whole years at the start date of a spouse or common-law partner of the RRSP annuitant (determined on the assumption that a spouse or common-law partner of the RRSP annuitant at the time the contract was acquired is a spouse or common-law partner of the RRSP annuitant at the start date), or (II) the periodic payments are payable for a term equal to 1 90 years minus the age described in sub-subclause (I)1, or 2 90 years minus the age described in sub-subclause (I)2, and (F) the periodic payments (I) are equal, or (II) are not equal solely because of one or more adjustments that would, if the contract were an annuity under a retirement savings plan, be in accordance with subparagraphs 146(3)(b)(iii) to (v) or that arise because of a uniform reduction in the entitlement to the periodic payments as a consequence of a partial surrender of rights to the periodic payments; and (l) a prescribed investment. ( placement admissible )
fr_fr: (2) La définition de placement admissible , au paragraphe 207.01(1) de la même loi, est remplacée par ce qui suit : placement admissible placement admissible Dans le cas d'une fiducie régie par un régime enregistré : a) des espèces, sauf celles ayant une valeur numismatique ou celles dont la juste valeur marchande est supérieure à la valeur nominale à titre de cours légal dans le pays d'émission, ainsi que des dépôts (au sens de la Loi sur la Société d'assurance-dépôts du Canada ou auprès d'une succursale au Canada d'une banque) de telles espèces portés au crédit de la fiducie; b) un certificat de placement garanti délivré par une société de fiducie constituée en société selon les lois fédérales ou provinciales; c) des obligations, débentures, billets ou titres semblables, (i) visés à l'alinéa a) de la définition de intérêts entièrement exonérés au paragraphe 212(3), (ii) émis par une société, une fiducie de fonds commun de placement ou une société de personnes en commandite dont les actions ou les unités sont inscrites à la cote d'une bourse de valeurs désignée située au Canada; (iii) émis par une société dont les actions sont inscrites à la cote d'une bourse de valeurs désignée située à l'étranger; (iv) émis par une banque étrangère autorisée, pourvu qu'ils soient payables à une succursale de la banque, située au Canada; (v) émis dans le cadre d'une émission unique d'au moins 25 000 000 $, ayant une cote d'évaluation supérieure attribuée par une agence de notation visée par règlement (ou ayant cette cote au moment de leur acquisition par la fiducie), (vi) émis de façon continue dans le cadre d'un programme d'émission de créances, pourvu qu'au moins 25 000 000 $ des créances émises et en circulation dans le cadre du programme aient une cote d'évaluation supérieure attribuée par une agence de notation visée par règlement (ou avaient cette cote au moment de leur acquisition par la fiducie), (vii) acquis par la fiducie en échange d'un titre de créance qui remplissait la condition prévue au sous-alinéa (v) ou (vi) dans le cadre d'une proposition ou d'un arrangement approuvé par la cour en vertu de la Loi sur la faillite et l'insolvabilité ou la Loi sur les arrangements avec les créanciers des compagnies , (viii) émis par une société publique (sauf une société de placement hypothécaire); d) un titre (sauf un contrat à terme ou un autre instrument dérivé dont le risque de perte pour le détenteur peut excéder le coût pour lui) qui est inscrit à la cote d'une bourse de valeurs désignée; e) une action du capital-actions d'une société publique (sauf une société de placement hypothécaire); f) un contrat de placement visé au sous-alinéa b)(ii) de la définition de régime d'épargne-retraite au paragraphe 146(1) et délivré par une société agréée par le gouverneur en conseil dans le cadre de ce sous-alinéa; g) un contrat relatif à une rente établi par un fournisseur de rentes autorisé, si les conditions suivantes sont réunies : (i) la fiducie est la seule personne qui, s'il est fait abstraction d'un transfert subséquent du contrat par la fiducie, a droit ou peut avoir droit à des paiements de rente dans le cadre du contrat, (ii) le titulaire du contrat a le droit d'exiger le rachat de celui-ci à tout moment pour un montant qui, s'il n'était pas tenu compte de frais de vente et d'administration raisonnables, correspondrait à peu près à la valeur des fonds qui pourraient servir par ailleurs à financer des paiements périodiques futurs dans le cadre du contrat; h) si le régime enregistré est un REEE, un placement acquis par la fiducie avant le 28 octobre 1998; i) si le régime enregistré est un REEI, un contrat de rente établi par un fournisseur de rentes autorisé, si, à la fois : (i) des paiements à effectuer périodiquement à intervalles ne dépassant pas un an sont ou peuvent être versés au titulaire dans le cadre du contrat, (ii) la fiducie est la seule personne qui, s'il est fait abstraction d'un transfert subséquent du contrat par la fiducie, a droit ou peut avoir droit à des paiements de rente dans le cadre du contrat, (iii) ni le montant d'un paiement prévu par le contrat, ni le moment de son versement, ne peuvent varier en raison de la durée d'une vie, sauf s'il s'agit de la vie du bénéficiaire en vertu du REEI (appelé « bénéficiaire du REEI » au présent alinéa), (iv) le versement des paiements périodiques a commencé ou doit commencer au plus tard à la fin de la dernière des années suivantes : (A) l'année dans laquelle le bénéficiaire du REEI atteint l'âge de 60 ans, (B) l'année suivant celle au cours de laquelle le contrat a été acheté par la fiducie, (v) les paiements périodiques sont payables au bénéficiaire du REEI à titre viager sans durée garantie aux termes du contrat ou pour une durée garantie n'excédant pas 15 ans, (vi) les paiements périodiques selon le cas : (A) sont égaux entre eux, (B) ne sont pas égaux entre eux en raison seulement d'un ou de plusieurs rajustements qui seraient conformes aux sous-alinéas 146(3)b)(iii) à (v) si le contrat était une rente prévue par un régime d'épargne-retraite ou qui découlent d'une réduction uniforme du droit aux paiements périodiques par suite d'un rachat partiel des droits à ces paiements, (vii) le contrat prévoit que, dans l'éventualité où il est mis fin au régime conformément à l'alinéa 146.4(4)p), les sommes qui seraient payables par ailleurs après la cessation du régime sont converties en un paiement unique; j) si le régime enregistré est un FERR, un contrat de rente établi par un fournisseur de rentes autorisé si, à la fois : (i) des paiements à effectuer périodiquement à intervalles ne dépassant pas un an sont ou peuvent être versés au titulaire dans le cadre du contrat, (ii) la fiducie est la seule personne qui, s'il est fait abstraction d'un transfert subséquent du contrat par la fiducie, a droit ou peut avoir droit à des paiements de rente dans le cadre du contrat, (iii) ni le montant d'un paiement prévu par le contrat, ni le moment de son versement, ne peuvent varier en raison de la durée d'une vie, sauf s'il s'agit : (A) de la vie du rentier en vertu du FERR (appelé « rentier du FERR » au présent alinéa) ou de celle de son époux ou conjoint de fait, dans le cas où le rentier du FERR a fait le choix prévu à la définition de fonds de revenu de retraite au paragraphe 146.3(1) relativement au fonds et à son époux ou conjoint de fait, (B) de la vie du rentier du FERR, dans les autres cas, (iv) le versement des paiements périodiques a commencé ou doit commencer au plus tard à la fin de l'année suivant celle au cours de laquelle le contrat a été acheté par la fiducie, (v) selon le cas : (A) les paiements périodiques sont payables au rentier du FERR à titre viager ou sont réversibles à l'époux ou conjoint de fait survivant, sans durée garantie ou pour une durée garantie, commençant à la date du début du versement des paiements, égale ou inférieure à la différence entre 90 et le moindre des âges suivants : (I) l'âge en années accomplies à cette date du rentier du FERR, à supposer qu'il soit vivant à cette date, (II) l'âge en années accomplies à cette date de l'époux ou conjoint de fait du rentier du FERR, à supposer que l'époux ou conjoint de fait du rentier au moment de l'achat du contrat soit son époux ou conjoint de fait à cette date, (B) les paiements périodiques sont payables pour un nombre d'années égal au nombre suivant, selon le cas : (I) 90 moins l'âge visé à la subdivision (A)(I), (II) 90 moins l'âge visé à la subdivision (A)(II), (vi) les paiements périodiques, selon le cas : (A) sont égaux entre eux, (B) ne sont pas égaux entre eux en raison seulement d'un ou de plusieurs rajustements soit qui seraient conformes aux sous-alinéas 146(3)b)(iii) à (v) si le contrat était une rente prévue par un régime d'épargne-retraite, soit qui découlent d'une réduction uniforme du droit aux paiements périodiques par suite d'un rachat partiel des droits à ces paiement; k) si le régime enregistré est un REER, un contrat de rente établi par un fournisseur de rentes autorisé si, selon le cas : (i) il est visé à la définition de revenu de retraite au paragraphe 146(1) relativement au rentier en vertu du REER (appelé « rentier du REER » au présent alinéa), (ii) il remplit les conditions suivantes : (A) des paiements à effectuer périodiquement à intervalles ne dépassant pas un an sont ou peuvent être versés au titulaire dans le cadre du contrat, (B) la fiducie est la seule personne qui, s'il est fait abstraction d'un transfert subséquent du contrat par la fiducie, a droit ou peut avoir droit à des paiements de rente dans le cadre du contrat, (C) ni le montant d'un paiement prévu par le contrat, ni le moment de son versement, ne peuvent varier en raison de la durée d'une vie, sauf s'il s'agit de la vie du rentier du REER, (D) le versement des paiements périodiques a commencé ou doit commencer au plus tard à la fin de l'année dans laquelle le rentier du REER atteint l'âge de 72 ans, (E) selon le cas : (I) les paiements périodiques sont payables au rentier du REER à titre viager sans durée garantie aux termes du contrat ou pour une durée garantie, commençant à la date du début du versement des paiements, égale ou inférieure à la différence entre 90 et le moindre des âges suivants : 1 l'âge en années accomplies à cette date du rentier du REER, à supposer qu'il soit vivant à cette date, 2 l'âge en années accomplies à cette date de l'époux ou conjoint de fait du rentier du REER, à supposer que l'époux ou conjoint de fait du rentier au moment de l'achat du contrat soit son époux ou conjoint de fait à cette date, (II) les paiements périodiques sont payables pour un nombre d'années égal au nombre suivant, selon le cas : 1 90 moins l'âge visé à la sous-subdivision (I)1, 2 90 moins l'âge visé à la sous-subdivision (I)2, (F) les paiements périodiques, selon le cas : (I) sont égaux entre eux, (II) ne sont pas égaux entre eux en raison seulement d'un ou de plusieurs rajustements soit qui seraient conformes aux sous-alinéas 146(3)b)(iii) à (v) si le contrat était une rente prévue par un régime d'épargne-retraite, soit qui découlent d'une réduction uniforme du droit aux paiements périodiques par suite d'un rachat partiel des droits à ces paiements; l) un placement visé par règlement. ( qualified investment )
